app/controllers/posts_controller.rb

    def create
    	@post = Post.new(post_params)
    	if @post.save
---
INSERT INTO "posts" ("username", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "186688"], ["title", "138468"], ["body", "125"], ["created_at", "2018-10-12 10:25:17.737165"], ["updated_at", "2018-10-12 10:25:17.737165"]]